/**
 * نماینده یک لیست گزینه برای انتخاب توسط داوطلب، شامل ویژگی‌های مختلف مرتبط با نمایش و رفتار گزینه‌ها.
 */
export type ChoiceList = {
  /**
   * آیا گزینه‌ها با تأخیر نمایش داده شوند؟
   * معمولاً در سوالات شنیداری برای جلوگیری از پیش‌نمایش استفاده می‌شود.
   */
  notShowImmediately: boolean;

  /**
   * لیست گزینه‌ها برای انتخاب توسط داوطلب.
   * می‌تواند شامل متن، تصویر، یا صوت باشد.
   */
  choices: Choice[];

  /**
   * نوع لیست گزینه‌ها (مثلاً تک‌گزینه‌ای، چندگزینه‌ای، Drag & Drop).
   * برای کنترل رفتار ارزیابی و نمایش.
   */
  choiceMode: AnswerSelectionMode;

  /**
   * آیا گزینه‌ها باید به ترتیب مشخص‌شده نمایش داده شوند؟
   * اگر false باشد، ممکن است به‌صورت تصادفی یا بر اساس منطق دیگر مرتب شوند.
   */
  isOrdered: boolean;
};

/**
 * نماینده یک گزینه برای انتخاب در سوالات، شامل ویژگی‌های مختلف مرتبط با گزینه.
 */
export type Choice = {
  /**
   * شماره گزینه در پاسخ‌نامه.
   * برای ثبت پاسخ داوطلب و ارزیابی.
   */
  id: number;

  /**
   * متن نمایشی گزینه.
   * می‌تواند شامل متن، تصویر، یا صوت باشد.
   */
  text: string;

  /**
   * ترتیب نمایش گزینه.
   * اگر مقدار داشته باشد، گزینه‌ها بر اساس آن مرتب می‌شوند؛ در غیر این‌صورت به‌صورت تصادفی.
   */
  order: number;
};

/**
 * نوع لیست گزینه‌های سوال.
 * مشخص‌کننده تعداد گزینه‌ها و نحوه تعامل داوطلب با آن‌ها.
 * برای کنترل رفتار نمایش، ارزیابی، و رندر فرم.
 */
export enum AnswerSelectionMode {
  /**
   * سوال با دو گزینه انتخابی.
   * معمولاً برای سوالات بله/خیر یا درست/نادرست.
   */
  MultiChoice2 = 0,

  /**
   * سوال با سه گزینه انتخابی.
   * برای سوالات با گزینه‌های محدود و ساده.
   */
  MultiChoice3 = 1,

  /**
   * سوال با چهار گزینه انتخابی.
   * رایج‌ترین ساختار در آزمون‌های استاندارد.
   */
  MultiChoice4 = 2,

  /**
   * سوال تک‌گزینه‌ای.
   * داوطلب فقط یک گزینه را می‌تواند انتخاب کند.
   */
  SingleChoice = 3,

  /**
   * سوال تعاملی از نوع کشیدن و رها کردن.
   * برای آزمون‌های تصویری یا مهارتی.
   */
  DragAndDrop = 4,
}
