// export type FormObject = {
//   state: FormObjectState;
//   label: string;
//   formObjectType: FormObjectType;
//   isEncrypted: boolean;
//   sign: unknown;
// };

/**
 * شیء فرم در دفترچه آزمون.
 * می‌تواند نمایانگر یک کنترل نمایشی، ورودی، یا عنصر تعاملی باشد.
 * در بخش‌هایی از آزمون برای نمایش، تعامل یا جمع‌آوری داده استفاده می‌شود.
 */
export type FormObject = {
  /**
   * وضعیت فعلی شیء فرم (فعال، غیرفعال، مخفی...).
   * برای کنترل نمایش یا تعامل در زمان اجرا.
   */
  state: FormObjectState;

  /**
   * عنوان یا برچسب نمایشی برای شیء فرم.
   * معمولاً برای نمایش به داوطلب یا در گزارش‌ها استفاده می‌شود.
   */
  label: string; // required

  /**
   * نوع شیء فرم (مثلاً دکمه، ورودی متن، تصویر، جدول...).
   * برای تعیین رفتار و رندر مناسب در کلاینت.
   */
  formObjectType: FormObjectType;
};

/**
 * وضعیت فعلی ابزار نمایشی.
 * برای کنترل نمایش، فعال‌سازی، یا غیرفعال‌سازی در فرم آزمون.
 */
export enum FormObjectState {
  /**
   * بدون وضعیت مشخص (غیرفعال یا تعریف‌نشده).
   */
  None = 0,

  /**
   * فعال و قابل استفاده.
   */
  Active = 2, // مقدار 1 باید به Active نسبت داده شود.

  /**
   * غیرفعال و غیرقابل تعامل.
   */
  Deactive = 3, // مقدار 2 باید به Deactive نسبت داده شود.

  /**
   * نمایش داده نشود.
   */
  NoDisplay = 1, // مقدار 3 باید به NoDisplay نسبت داده شود.
}

/**
 * انواع ابزارهای نمایشی در فرم آزمون.
 */
export enum FormObjectType {
  /**
   * دکمه مرور کلی.
   */
  Review = 1,

  /**
   * دکمه کنترل صدا.
   */
  VolumeButton = 2,

  /**
   * دکمه راهنما.
   */
  HelpButton = 3,

  /**
   * دکمه قبلی.
   */
  BackButton = 4,

  /**
   * دکمه بعدی.
   */
  NextButton = 5,

  /**
   * دکمه ادامه.
   */
  ContinueButton = 6,

  /**
   * برچسب نمایشی.
   */
  Label = 7,

  /**
   * کنترل صدا (غیرفعال یا نمایشی).
   */
  VolumeControl = 8,

  /**
   * نمایش زمان آزمون.
   */
  TimerLabel = 9,

  /**
   * دکمه پنهان کردن زمان.
   */
  TimerHideButton = 10,

  /**
   * نمایش تعداد سوالات.
   */
  QuestionLabel = 11,

  /**
   * دکمه مرور متن.
   */
  ReviewTextButton = 12,

  /**
   * دکمه مرور سوالات.
   */
  ReviewQuestionButton = 13,

  /**
   * دکمه تایید.
   */
  OkButton = 14,

  /**
   * دکمه نشانه‌گذاری سوال.
   */
  MarkButton = 15,

  /**
   * دکمه پرش از بخش آزمون.
   */
  SkipDirection = 16,
}
